#+LATEX_HEADER: \usepackage{pgfgantt}
#+LATEX_HEADER: \usepackage{lscape}
#+LATEX_HEADER: \usepackage{graphicx}

* Something
** Else  [32%]
   DEADLINE: <2015-06-22 Mo> SCHEDULED: <2015-05-29 Fr>
   :PROPERTIES:
   :CUSTOM_ID: Else123
   :END:      
** don't bother
* Ordered-Test :test:
   DEADLINE: <2015-05-26 Di>
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order1
   CLOCK: [2015-05-20 Mi 11:06]--[2015-05-20 Mi 11:06] =>  0:00
   CLOCK: [2015-05-19 Di 17:00]--[2015-05-20 Mi 01:30] =>  8:30
   CLOCK: [2015-05-19 Di 17:40]--[2015-05-20 Mi 01:10] =>  7:30
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order2
   CLOCK: [2015-05-27 Mi 13:35]--[2015-05-27 Mi 21:35] =>  8:00
   :PROPERTIES:
   :Effort:   2d
   :END:
** Millstone 							   :milestone:
* Ordered-Test2 :toast:
  :PROPERTIES:
  :ORDERED:  t
  :ID: ordered123
  :END:      
** Order3
   SCHEDULED: <2015-05-21 Do>
   :PROPERTIES:
   :Effort:   1d
   :END:
** Order4 :l2tag:
*** SO 1
   :PROPERTIES:
   :Effort:   3:00
   :END:
*** SO 2
   :PROPERTIES:
   :Effort:   5:00
   :END:
*** SO 3
   :PROPERTIES:
   :Effort:   3:00
   :END:

* Direct Schedule Test
  DEADLINE: <2015-06-04 Do> SCHEDULED: <2015-05-15 Fr>

#+BEGIN_landscape
#+BEGIN: org-gantt-chart :tikz-options "scale=0.5, every node/.style={scale=0.5}" :weekend-style "{draw=blue!10, line width=1pt}" :workday-style "{draw=blue!5, line width=.75pt}" :show-progress if-value :progress-source cookie-clocksum :no-date-headlines inactive :parameters "y unit title=.7cm, y unit chart=.9cm" :tags-group-style (("test"."group label font=\\color{blue}")("toast"."group label font=\\color{green}")) :tags-bar-style (("test"."bar label font=\\color{blue}")("toast"."bar label font=\\color{green}"))
\begin{tikzpicture}[scale=0.5, every node/.style={scale=0.5}]
\begin{ganttchart}[time slot format=isodate, vgrid={*3{draw=blue!10, line width=1pt},*4{draw=blue!5, line width=.75pt}}, y unit title=.7cm, y unit chart=.9cm]{2015-05-15}{2015-06-22}
\gantttitlecalendar{year, month=name, day}\\
\ganttgroup[group left shift=0.0, group right shift=-0.0]{Something}{2015-05-29}{2015-06-22}\\
  \ganttbar[bar left shift=0.0, bar right shift=-0.0,progress=32]{Else}{2015-05-29}{2015-06-22}\\
  \ganttbar[bar left shift=0.0, bar right shift=0]{don't bother}{2015-05-15}{2015-05-15}\\
\ganttgroup[group left shift=0.0, group right shift=-0.0,progress=67, group label font=\color{blue}]{Ordered-Test}{2015-05-22}{2015-05-26}\\
  \ganttbar[bar left shift=0.0, bar right shift=-0.0,progress=200, bar label font=\color{blue}]{Order1}{2015-05-22}{2015-05-22}\\
  \ganttlinkedbar[bar left shift=0.0, bar right shift=-0.0,progress=50, bar label font=\color{blue}]{Order2}{2015-05-25}{2015-05-26}\\
  \ganttlinkedmilestone[bar left shift=0.0, bar right shift=-0.0, bar label font=\color{blue}]{Millstone}{2015-05-26}\\
\ganttgroup[group left shift=0.0, group right shift=-0.625, group label font=\color{green}]{Ordered-Test2}{2015-05-21}{2015-05-25}\\
  \ganttbar[bar left shift=0.0, bar right shift=-0.0, bar label font=\color{green}]{Order3}{2015-05-21}{2015-05-21}\\
  \ganttlinkedgroup[group left shift=0.0, group right shift=-0.625, group label font=\color{green}]{Order4}{2015-05-22}{2015-05-25}\\
    \ganttbar[bar left shift=0.0, bar right shift=-0.625, bar label font=\color{green}]{SO 1}{2015-05-22}{2015-05-22}\\
    \ganttlinkedbar[bar left shift=0.375, bar right shift=-0.0, bar label font=\color{green}]{SO 2}{2015-05-22}{2015-05-22}\\
    \ganttlinkedbar[bar left shift=0.0, bar right shift=-0.625, bar label font=\color{green}]{SO 3}{2015-05-25}{2015-05-25}\\
\ganttbar[bar left shift=0.0, bar right shift=-0.0]{Direct Schedule Test}{2015-05-15}{2015-06-04}\\
\end{ganttchart}
\end{tikzpicture}
#+END:
#+END_landscape
